In [1]:
import pandas as pd
import sqlite3 as sq

C:\Users\ujjwa\AppData\Local\Temp\ipykernel_16884\3610780369.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
db=sq.connect("Library.Db")
cur=db.cursor()
print("Database Created Sucessfully.")

Database Created Sucessfully.

In [3]:
cur.execute("""
CREATE TABLE Authors (
AuthorID INT PRIMARY KEY,
AuthorName VARCHAR(25) NOT NULL
);
""")
print("Table Authors Created Sucessfully.")

Table Authors Created Sucessfully.

In [4]:
cur.execute("INSERT INTO Authors VALUES(101,'Author 1');")
cur.execute("INSERT INTO Authors VALUES(102,'Author 2');")
cur.execute("INSERT INTO Authors VALUES(103,'Author 3');")
cur.execute("INSERT INTO Authors VALUES(104,'Author 4');")
cur.execute("INSERT INTO Authors VALUES(105,'Author 5');")
print("Data Inserted in Table Authors Sucessfully.")

Data Inserted in Table Authors Sucessfully.

In [5]:
cur.execute("SELECT * FROM Authors;")
Authors=cur.fetchall()

In [6]:
print(pd.DataFrame(Authors,columns=["Author_ID","Author_Name"],index=[1,2,3,4,5]))

   Author_ID Author_Name
1        101    Author 1
2        102    Author 2
3        103    Author 3
4        104    Author 4
5        105    Author 5

In [7]:
cur.execute("""
CREATE TABLE Books (
    BookID INT PRIMARY KEY,
    Title VARCHAR(25) NOT NULL,
    ISBN VARCHAR(10) UNIQUE,
    PublicationYear INT,
    AuthorID INT,
    FOREIGN KEY (AuthorID) REFERENCES Authors(AuthorID)
);
""")
print("Table Books Created Sucessfully.")

Table Books Created Sucessfully.

In [8]:
cur.execute("INSERT INTO Books VALUES(1001,'Book 1','ISBN001',2020,101);")
cur.execute("INSERT INTO Books VALUES(1002,'Book 2','ISBN002',2019,102);")
cur.execute("INSERT INTO Books VALUES(1003,'Book 3','ISBN003',2018,103);")
cur.execute("INSERT INTO Books VALUES(1004,'Book 4','ISBN004',2017,104);")
cur.execute("INSERT INTO Books VALUES(1005,'Book 5','ISBN005',2016,105);")
print("Data Inserted in Table Books Sucessfully.")

Data Inserted in Table Books Sucessfully.

In [9]:
cur.execute("SELECT * FROM Books;")
Books=cur.fetchall()

In [10]:
print(pd.DataFrame(Books,columns=["Book_ID","Title","ISBN_NO","Publication_Year","Author_ID"],index=[1,2,3,4,5]))

   Book_ID   Title  ISBN_NO  Publication_Year  Author_ID
1     1001  Book 1  ISBN001              2020        101
2     1002  Book 2  ISBN002              2019        102
3     1003  Book 3  ISBN003              2018        103
4     1004  Book 4  ISBN004              2017        104
5     1005  Book 5  ISBN005              2016        105

In [11]:
cur.execute("""
CREATE TABLE Users(
    UserID INT PRIMARY KEY,
    FirstName VARCHAR(50) NOT NULL,
    LastName VARCHAR(50) NOT NULL,
    Email VARCHAR(100)
);
""")
print("Table Users Created Sucessfully.")

Table Users Created Sucessfully.

In [12]:
cur.execute("INSERT INTO Users VALUES(10001,'Ujjwal','Chavan','UC@gmail.com');")
cur.execute("INSERT INTO Users VALUES(10002,'Omkar','Mandlik','OM@gmail.com');")
cur.execute("INSERT INTO Users VALUES(10003,'Hitesh','Paighan','HP@gmail.com');")
cur.execute("INSERT INTO Users VALUES(10004,'Bhupesh','Shinde','BS@gmail.com');")
cur.execute("INSERT INTO Users VALUES(10005,'Saiee','Gavate','SG@gmail.com');")
print("Data Inserted in Table Users Sucessfully.")

Data Inserted in Table Users Sucessfully.

In [13]:
cur.execute("SELECT * FROM Users;")
Users=cur.fetchall()

In [14]:
print(pd.DataFrame(Users,columns=["User_ID","First_Name","Last_Name","Email_ID"],index=[1,2,3,4,5]))

   User_ID First_Name Last_Name      Email_ID
1    10001     Ujjwal    Chavan  UC@gmail.com
2    10002      Omkar   Mandlik  OM@gmail.com
3    10003     Hitesh   Paighan  HP@gmail.com
4    10004    Bhupesh    Shinde  BS@gmail.com
5    10005      Saiee    Gavate  SG@gmail.com

In [15]:
cur.execute("""
CREATE TABLE BorrowedBooks(
BorrowID INT PRIMARY KEY,
UserID INT,
BookID INT,
BorrowDate DATE,
ReturnDate DATE,
FOREIGN KEY (UserID) REFERENCES Users(UserID),
FOREIGN KEY (BookID) REFERENCES Books(BookID)
);
""")
print("Table Borrowed Books Created Sucessfully.")

Table Borrowed Books Created Sucessfully.

In [16]:
cur.execute("INSERT INTO BorrowedBooks VALUES(1,10001,1001,'2023-11-01','2023-11-14');")
cur.execute("INSERT INTO BorrowedBooks VALUES(2,10002,1002,'2023-11-02','2023-11-15');")
cur.execute("INSERT INTO BorrowedBooks VALUES(3,10003,1003,'2023-11-03','2023-11-16');")
cur.execute("INSERT INTO BorrowedBooks VALUES(4,10004,1004,'2023-11-04','2023-11-17');")
cur.execute("INSERT INTO BorrowedBooks VALUES(5,10005,1005,'2023-11-05','2023-11-18');")
print("Data Inserted in Table Borrowed Books Sucessfully.")

Data Inserted in Table Borrowed Books Sucessfully.

In [17]:
cur.execute("SELECT * FROM BorrowedBooks;")
BorrowedBooks=cur.fetchall()

In [18]:
print(pd.DataFrame(BorrowedBooks,columns=["Borrow_ID","User_ID","Book_ID","Borrow_Date","Return_Date"],index=[1,2,3,4,5]))

   Borrow_ID  User_ID  Book_ID Borrow_Date Return_Date
1          1    10001     1001  2023-11-01  2023-11-14
2          2    10002     1002  2023-11-02  2023-11-15
3          3    10003     1003  2023-11-03  2023-11-16
4          4    10004     1004  2023-11-04  2023-11-17
5          5    10005     1005  2023-11-05  2023-11-18

In [19]:
cur.execute("""
SELECT Users.FirstName, Users.LastName, Books.Title, BorrowedBooks.BorrowDate, BorrowedBooks.ReturnDate
FROM Users
JOIN BorrowedBooks ON Users.UserID = BorrowedBooks.UserID
JOIN Books ON BorrowedBooks.BookID = Books.BookID
WHERE Users.UserID = 10001;
""")
User_Record=cur.fetchall()

In [20]:
print(pd.DataFrame(User_Record,columns=["First_Name","Last_Name","Title","Borrow_Date","Return_Date"],index=["User_Record"]))

            First_Name Last_Name   Title Borrow_Date Return_Date
User_Record     Ujjwal    Chavan  Book 1  2023-11-01  2023-11-14

In [21]:
cur.execute("""
SELECT Authors.AuthorName, Books.Title, Books.ISBN, Books.PublicationYear
FROM Authors
JOIN Books ON Authors.AuthorID = Books.AuthorID
WHERE Authors.AuthorName = 'Author 1';
""")
Book_Record=cur.fetchall()

In [22]:
print(pd.DataFrame(Book_Record,columns=["Author_Name","Title","ISBN_NO","Publication_Year"],index=["Book_Record"]))

            Author_Name   Title  ISBN_NO  Publication_Year
Book_Record    Author 1  Book 1  ISBN001              2020